In [1]:
import pandas as pd
import numpy as np

In [5]:
data=np.random.randint(10,30,12)
data=data.reshape(4,3)

In [7]:
df=pd.DataFrame(data,index=['R1','R2','R3','R4'],columns=['C1','C2','C3'])
df

    C1  C2  C3
R1  19  14  22
R2  20  18  14
R3  28  16  28
R4  29  21  22

In [ ]:
df.describe()  #To find all stats of each column data

              C1         C2         C3
count   4.000000   4.000000   4.000000
mean   24.000000  17.250000  21.500000
std     5.228129   2.986079   5.744563
min    19.000000  14.000000  14.000000
25%    19.750000  15.500000  20.000000
50%    24.000000  17.000000  22.000000
75%    28.250000  18.750000  23.500000
max    29.000000  21.000000  28.000000

In [9]:
df['C3'].unique

<bound method Series.unique of R1    22
R2    14
R3    28
R4    22
Name: C3, dtype: int32>

In [20]:
df[df['C1']>20]

    C1  C2  C3
R3  28  16  28
R4  29  21  22

In [22]:
df.head(2)

    C1  C2  C3
R1  19  14  22
R2  20  18  14

In [23]:
df.tail(2)

    C1  C2  C3
R3  28  16  28
R4  29  21  22